In [2]:
import pandas
# see pandas documentation of series and dataframe convert to python code usefull datatypes

# csv

In [4]:
df1 = pandas.read_csv('files/supermarkets.csv')

In [12]:
df1["City"],df1.City

(0    San Francisco
 1    San Francisco
 2    San Francisco
 3    San Francisco
 4    San Francisco
 5    San Francisco
 Name: City, dtype: object,
 0    San Francisco
 1    San Francisco
 2    San Francisco
 3    San Francisco
 4    San Francisco
 5    San Francisco
 Name: City, dtype: object)

In [13]:
df1[df1.City=='San Francisco']
#get row

,ID,Address,City,State,Country,Name,Employees
0,1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8
1,2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
2,3,332 Hill St,San Francisco,California 94114,USA,Super River,25
3,4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10
4,5,1056 Sanchez St,San Francisco,California,USA,Sanchez,12
5,6,551 Alvarado St,San Francisco,CA 94114,USA,Richvalley,20

# xlsx

In [28]:
df2 = pandas.read_excel('files/supermarkets.xlsx', sheet_name=0)

In [29]:
df2

,ID,Address,City,State,Country,Supermarket Name,Number of Employees
0,1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8
1,2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
2,3,332 Hill St,San Francisco,California 94114,USA,Super River,25
3,4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10
4,5,1056 Sanchez St,San Francisco,California,USA,Sanchez,12
5,6,551 Alvarado St,San Francisco,CA 94114,USA,Richvalley,20

# json

In [30]:
df3 = pandas.read_json('files/supermarkets.json')

In [31]:
df3

,ID,Address,City,State,Country,Name,Employees
0,1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8
1,2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
2,3,332 Hill St,San Francisco,California 94114,USA,Super River,25
3,4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10
4,5,1056 Sanchez St,San Francisco,California,USA,Sanchez,12
5,6,551 Alvarado St,San Francisco,CA 94114,USA,Richvalley,20

# txt

In [33]:
df4 = pandas.read_csv('files/supermarkets-commas.txt')

In [34]:
df4

,ID,Address,City,State,Country,Name,Employees
0,1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8
1,2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
2,3,332 Hill St,San Francisco,California 94114,USA,Super River,25
3,4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10
4,5,1056 Sanchez St,San Francisco,California,USA,Sanchez,12
5,6,551 Alvarado St,San Francisco,CA 94114,USA,Richvalley,20

# semi-colon

In [41]:
df5 = pandas.read_csv('files/supermarkets-semi-colons.txt', sep=';') # sep or delimiter

In [42]:
df5

,ID,Address,City,State,Country,Name,Employees
0,1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8
1,2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
2,3,332 Hill St,San Francisco,California 94114,USA,Super River,25
3,4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10
4,5,1056 Sanchez St,San Francisco,California,USA,Sanchez,12
5,6,551 Alvarado St,San Francisco,CA 94114,USA,Richvalley,20

# csv no-header

In [44]:
df6 = pandas.read_csv('files/supermarkets-header.txt', header=None)

In [45]:
df6

   0                1              2                 3    4            5   6
0  1     3666 21st St  San Francisco          CA 94114  USA      Madeira   8
1  2   735 Dolores St  San Francisco          CA 94119  USA  Bready Shop  15
2  3      332 Hill St  San Francisco  California 94114  USA  Super River  25
3  4     3995 23rd St  San Francisco          CA 94114  USA   Ben's Shop  10
4  5  1056 Sanchez St  San Francisco        California  USA      Sanchez  12
5  6  551 Alvarado St  San Francisco          CA 94114  USA   Richvalley  20

In [51]:
df6.columns = ['Id', 'Address', 'City', 'Zip', 'Country', 'Name', 'Employees']

In [63]:
df6

,Id,Address,City,Zip,Country,Name,Employees
0,1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8
1,2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
2,3,332 Hill St,San Francisco,California 94114,USA,Super River,25
3,4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10
4,5,1056 Sanchez St,San Francisco,California,USA,Sanchez,12
5,6,551 Alvarado St,San Francisco,CA 94114,USA,Richvalley,20

# indexing and slicing

In [81]:
list(df6.loc[:,'Name'])

[' Madeira',
 'Bready Shop',
 'Super River',
 "Ben's Shop",
 'Sanchez',
 'Richvalley']

In [76]:
df6.loc[:,'Name']

0        Madeira
1    Bready Shop
2    Super River
3     Ben's Shop
4        Sanchez
5     Richvalley
Name: Name, dtype: object

In [82]:
df6

,Id,Address,City,Zip,Country,Name,Employees
0,1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8
1,2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
2,3,332 Hill St,San Francisco,California 94114,USA,Super River,25
3,4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10
4,5,1056 Sanchez St,San Francisco,California,USA,Sanchez,12
5,6,551 Alvarado St,San Francisco,CA 94114,USA,Richvalley,20

In [86]:
df6.iloc[1:3,2:4] # either row or column is alos possible

            City               Zip
1  San Francisco          CA 94119
2  San Francisco  California 94114

# deleting columns and rows

In [90]:
df6.drop('City',1)

   Id          Address               Zip Country         Name  Employees
0   1     3666 21st St          CA 94114     USA      Madeira          8
1   2   735 Dolores St          CA 94119     USA  Bready Shop         15
2   3      332 Hill St  California 94114     USA  Super River         25
3   4     3995 23rd St          CA 94114     USA   Ben's Shop         10
4   5  1056 Sanchez St        California     USA      Sanchez         12
5   6  551 Alvarado St          CA 94114     USA   Richvalley         20

In [91]:
df6.drop(df6.columns[0:3],1)

                Zip Country         Name  Employees
0          CA 94114     USA      Madeira          8
1          CA 94119     USA  Bready Shop         15
2  California 94114     USA  Super River         25
3          CA 94114     USA   Ben's Shop         10
4        California     USA      Sanchez         12
5          CA 94114     USA   Richvalley         20

In [92]:
df6.columns

Index(['Id', 'Address', 'City', 'Zip', 'Country', 'Name', 'Employees'], dtype='object')

# updating and adding columns and rows

In [100]:
df6

,Id,Address,City,Zip,Country,Name,Employees,29,salary
0,1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8,bhaktapur,2000
1,2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15,tumacho,3000
2,3,332 Hill St,San Francisco,California 94114,USA,Super River,25,44800,2000
3,4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10,Nepal,3000
4,5,1056 Sanchez St,San Francisco,California,USA,Sanchez,12,Rabin,3000
5,6,551 Alvarado St,San Francisco,CA 94114,USA,Richvalley,20,23,3000

In [126]:
df6['salary'] = [2000, 3000, 2000, 3000, 3000, 3000] # add columns
df6['continent'] = df6.shape[0]*['asia'] # add columns
new_row = {"Id":99, 'Address':'bhaktapur', 'City':'Kathmandu', 'Zip':44800, 'Country':'NEpal', 'Name':"rabin", 'salary':"45678", 'continent':'Asia'}
df6 = df6.append(new_row, ignore_index=True)

In [127]:
df6

,Id,Address,City,Zip,Country,Name,salary,continent
0,1,3666 21st St,San Francisco,CA 94114,USA,Madeira,2000,asia
1,2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,3000,asia
2,3,332 Hill St,San Francisco,California 94114,USA,Super River,2000,asia
3,4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,3000,asia
4,5,1056 Sanchez St,San Francisco,California,USA,Sanchez,3000,asia
5,6,551 Alvarado St,San Francisco,CA 94114,USA,Richvalley,3000,asia
6,99,bhaktapur,Kathmandu,44800,NEpal,rabin,45678,Asia

In [128]:
df6['continent'] = df6['Country'] + " , " + df6['City']

In [129]:
df6

,Id,Address,City,Zip,Country,Name,salary,continent
0,1,3666 21st St,San Francisco,CA 94114,USA,Madeira,2000,"USA , San Francisco"
1,2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,3000,"USA , San Francisco"
2,3,332 Hill St,San Francisco,California 94114,USA,Super River,2000,"USA , San Francisco"
3,4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,3000,"USA , San Francisco"
4,5,1056 Sanchez St,San Francisco,California,USA,Sanchez,3000,"USA , San Francisco"
5,6,551 Alvarado St,San Francisco,CA 94114,USA,Richvalley,3000,"USA , San Francisco"
6,99,bhaktapur,Kathmandu,44800,NEpal,rabin,45678,"NEpal , Kathmandu"

## transpose

In [130]:
df6_t = df6.T

In [131]:
df6_t

,0,1,2,3,4,5,6
Id,1,2,3,4,5,6,99
Address,3666 21st St,735 Dolores St,332 Hill St,3995 23rd St,1056 Sanchez St,551 Alvarado St,bhaktapur
City,San Francisco,San Francisco,San Francisco,San Francisco,San Francisco,San Francisco,Kathmandu
Zip,CA 94114,CA 94119,California 94114,CA 94114,California,CA 94114,44800
Country,USA,USA,USA,USA,USA,USA,NEpal
Name,Madeira,Bready Shop,Super River,Ben's Shop,Sanchez,Richvalley,rabin
salary,2000,3000,2000,3000,3000,3000,45678
continent,"USA , San Francisco","USA , San Francisco","USA , San Francisco","USA , San Francisco","USA , San Francisco","USA , San Francisco","NEpal , Kathmandu"

In [132]:
type(df6)

pandas.core.frame.DataFrame

In [147]:
df6['Address']

0       3666 21st St
1     735 Dolores St
2        332 Hill St
3       3995 23rd St
4    1056 Sanchez St
5    551 Alvarado St
6          bhaktapur
Name: Address, dtype: object

In [1]:
import geopy
from geopy.geocoders import Nominatim

In [140]:
nom = Nominatim()

In [155]:
n = nom.geocode('bhaktapur, nepal')

In [160]:
print('lantitude', n.latitude)
print('longitude', n.longitude)

lantitude 27.6720657
longitude 85.428171

In [154]:
for loc in df6['Address']:
        print(nom.geocode(loc))

21st Street, Financial District, Oakland, Alameda County, California, 94612, United States of America
735, Dolores Street, Stanford, Professorville Historic District, Santa Clara County, California, 94305, United States of America
332, Hill Street, Westlake, Daly City, San Mateo County, California, 94014, United States of America
23rd Street, Universal Truckload Services, Southwest Detroit, Detroit, Wayne County, Michigan, 48216, United States of America
1056, Sanchez Street, United States, Laredo, Webb County, Texas, 78040, United States of America
551, Alvarado Street, Fairways of Walnut Creek, Mansfield, Tarrant County, Texas, 76063, United States of America
Bhaktapur, भक्तपुर, वाग्मती प्रदेश, 44880, Nepal

# New data set

In [189]:
df10 = pandas.read_csv('files/supermarkets.csv')

In [190]:
df10

,ID,Address,City,State,Country,Name,Employees
0,1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8
1,2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
2,3,332 Hill St,San Francisco,California 94114,USA,Super River,25
3,4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10
4,5,1056 Sanchez St,San Francisco,California,USA,Sanchez,12
5,6,551 Alvarado St,San Francisco,CA 94114,USA,Richvalley,20

In [191]:
df10['Address'] = df10['Address'] + "," + df10['City'] +", " + df10['State'] + "," + df10['Country']

In [192]:
df10

,ID,Address,City,State,Country,Name,Employees
0,1,"3666 21st St,San Francisco, CA 94114,USA",San Francisco,CA 94114,USA,Madeira,8
1,2,"735 Dolores St,San Francisco, CA 94119,USA",San Francisco,CA 94119,USA,Bready Shop,15
2,3,"332 Hill St,San Francisco, California 94114,USA",San Francisco,California 94114,USA,Super River,25
3,4,"3995 23rd St,San Francisco, CA 94114,USA",San Francisco,CA 94114,USA,Ben's Shop,10
4,5,"1056 Sanchez St,San Francisco, California,USA",San Francisco,California,USA,Sanchez,12
5,6,"551 Alvarado St,San Francisco, CA 94114,USA",San Francisco,CA 94114,USA,Richvalley,20

In [193]:
from geopy.geocoders import Nominatim

In [194]:
nomi = Nominatim()

In [171]:
for loc in df10['Address']:
    print('Address: ', nomi.geocode(loc))

Address:  3666, 21st Street, Noe Valley, San Francisco, San Francisco City and County, California, 94114, United States of America
Address:  735, Dolores Street, Liberty Street Historic District, San Francisco, San Francisco City and County, California, 94110, United States of America
Address:  332, Hill Street, Noe Valley, San Francisco, San Francisco City and County, California, 94114, United States of America
Address:  3995, 23rd Street, Noe Valley, San Francisco, San Francisco City and County, California, 94114, United States of America
Address:  1056, Sanchez Street, Noe Valley, San Francisco, San Francisco City and County, California, 94114, United States of America
Address:  551, Alvarado Street, Noe Valley, San Francisco, San Francisco City and County, California, 94114, United States of America

In [195]:
df10['Coordinates'] = df10['Address'].apply(nomi.geocode) # adding new column directly from geopy
df10

,ID,Address,City,State,Country,Name,Employees,Coordinates
0,1,"3666 21st St,San Francisco, CA 94114,USA",San Francisco,CA 94114,USA,Madeira,8,"(3666, 21st Street, Noe Valley, San Francisco,..."
1,2,"735 Dolores St,San Francisco, CA 94119,USA",San Francisco,CA 94119,USA,Bready Shop,15,"(735, Dolores Street, Liberty Street Historic ..."
2,3,"332 Hill St,San Francisco, California 94114,USA",San Francisco,California 94114,USA,Super River,25,"(332, Hill Street, Noe Valley, San Francisco, ..."
3,4,"3995 23rd St,San Francisco, CA 94114,USA",San Francisco,CA 94114,USA,Ben's Shop,10,"(3995, 23rd Street, Noe Valley, San Francisco,..."
4,5,"1056 Sanchez St,San Francisco, California,USA",San Francisco,California,USA,Sanchez,12,"(1056, Sanchez Street, Noe Valley, San Francis..."
5,6,"551 Alvarado St,San Francisco, CA 94114,USA",San Francisco,CA 94114,USA,Richvalley,20,"(551, Alvarado Street, Noe Valley, San Francis..."

In [196]:
df10.Coordinates[0].point

Point(37.75648887755102, -122.42934334693878, 0.0)

In [197]:
# df10['longitude'] = df10['Coordinates'][0].longitude
# df10['latitude'] = df10['Coordinates'][0].latitude
df10['point'] = df10['Coordinates'][0].point

In [198]:
df10

,ID,Address,City,State,Country,Name,Employees,Coordinates,point
0,1,"3666 21st St,San Francisco, CA 94114,USA",San Francisco,CA 94114,USA,Madeira,8,"(3666, 21st Street, Noe Valley, San Francisco,...","37 45m 23.36s N, 122 25m 45.636s W"
1,2,"735 Dolores St,San Francisco, CA 94119,USA",San Francisco,CA 94119,USA,Bready Shop,15,"(735, Dolores Street, Liberty Street Historic ...","37 45m 23.36s N, 122 25m 45.636s W"
2,3,"332 Hill St,San Francisco, California 94114,USA",San Francisco,California 94114,USA,Super River,25,"(332, Hill Street, Noe Valley, San Francisco, ...","37 45m 23.36s N, 122 25m 45.636s W"
3,4,"3995 23rd St,San Francisco, CA 94114,USA",San Francisco,CA 94114,USA,Ben's Shop,10,"(3995, 23rd Street, Noe Valley, San Francisco,...","37 45m 23.36s N, 122 25m 45.636s W"
4,5,"1056 Sanchez St,San Francisco, California,USA",San Francisco,California,USA,Sanchez,12,"(1056, Sanchez Street, Noe Valley, San Francis...","37 45m 23.36s N, 122 25m 45.636s W"
5,6,"551 Alvarado St,San Francisco, CA 94114,USA",San Francisco,CA 94114,USA,Richvalley,20,"(551, Alvarado Street, Noe Valley, San Francis...","37 45m 23.36s N, 122 25m 45.636s W"